#include <iostream>
#include <string>
#include <unordered_map>

using std::cout;
using std::endl;
using std::string;

using ManoEncoder = std::unordered_map<char16_t, string>;

void DictionaryMaker(ManoEncoder& dictionary);

int main()
{
    ManoEncoder enc;

    DictionaryMaker(enc);

    std::wstring str = L"‚Ü‚Ì‚¿‚á‚ñ‚©‚í‚¢‚¢";

    for (auto x : str)
    {
        cout << enc[x];
    }
}

void DictionaryMaker(ManoEncoder& dictionary)
{
    dictionary[12435] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12353] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[103] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[89] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[43] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12413] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12401] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[35] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12405] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[114] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12419] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12371] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12384] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12434] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12402] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12366] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12423] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12383] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12420] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[95] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[53] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[110] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12377] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[52] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[76] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12368] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12409] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[115] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12388] = "‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12540] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12425] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[56] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[100] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12429] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[111] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12399] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12381] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[117] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[68] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[120] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[122] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12378] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[116] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12390] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12379] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[50] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12400] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12431] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12394] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12356] = "‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12375] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12360] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[80] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12412] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[70] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[37] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[38] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12396] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[41] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[71] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[40] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12424] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12393] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12398] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[49] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[67] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[78] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12374] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[58] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12411] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12385] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12373] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12362] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12367] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[46] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[66] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[94] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[36] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[92] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12357] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[39] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[124] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12410] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[42] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[126] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[59] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12359] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12416] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12428] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12364] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[72] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[87] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[63] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[86] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[101] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12397] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[69] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[98] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[51] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12365] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12358] = "‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12395] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12392] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[82] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[83] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[118] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[73] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[108] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12408] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[113] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12386] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[44] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12404] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[33] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[54] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[102] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[48] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[104] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[97] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12417] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[84] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[55] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[85] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12427] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12414] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[109] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[64] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12372] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[81] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[106] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[57] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12354] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12421] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[105] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12376] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[47] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12418] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12403] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[90] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[45] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[61] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[125] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12361] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12355] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[123] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12407] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[91] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[93] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12382] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[121] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12415] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12369] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12363] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12426] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[119] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12389] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[74] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[79] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[77] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[112] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12391] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[65] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12422] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12370] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12406] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12380] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[99] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[34] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[88] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[75] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[107] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12387] = "‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";

}
