#include <iostream>
#include <string>
#include <unordered_map>
#include <locale>
#include <clocale>
#include <algorithm>
#include <climits>
#include <iomanip>

using std::cout;
using std::endl;

//https://gist.github.com/calbonaler/1231f78c63fb0b78d26d368a025b1cce
std::string toChars(int ch) {
    std::string chars;
    unsigned int chu = static_cast<unsigned int>(ch);
    for (size_t i = 0; i < sizeof(chu); ++i)
    {
        char ch = static_cast<char>((chu >> (i * CHAR_BIT)) & ((1u << CHAR_BIT) - 1u));
        if (!ch) break;
        chars.push_back(ch);
    }
    std::reverse(chars.begin(), chars.end());
    return chars;
}

class ManoTranslator
{
public: //alias
    
    using string = std::wstring;

    using Encoder = std::unordered_map<wchar_t, ManoTranslator::string>;
    using Decoder = std::unordered_map<ManoTranslator::string, wchar_t>;

private: //variables

    Encoder m_encoder;
    Decoder m_decoder;

public: //constructors

    ManoTranslator();

public: //funcs

    [[nodiscard]]
    Encoder GetEncoder() const
    {
        return m_encoder;
    }

    [[nodiscard]]
    Decoder GetDecoder() const
    {
        return m_decoder;
    }

    //[[nodiscard]]
    ManoTranslator::string Encode(const ManoTranslator::string& str) const;

    //[[nodiscard]]
    ManoTranslator::string Decode(const ManoTranslator::string& str) const;


public: //static funcs

//    [[nodiscard]]
//    static ManoTranslator::string to_string(ManoTranslator::string str);
    static void EncoderMaker(Encoder& dictionary);
    static void DecoderMaker(Decoder& dictionary);
};


int main()
{
    ManoTranslator mano;



    return 0;
}

ManoTranslator::ManoTranslator()
{
    EncoderMaker(m_encoder);
    DecoderMaker(m_decoder);
}

ManoTranslator::string ManoTranslator::Encode(const ManoTranslator::string& str) const
{
    ManoTranslator::string result;

    for (auto w : str)
    {
        if (m_encoder.count(w) == 0)
        {
            result += w;
            continue;
        }
        result += m_encoder.at(w);
    }

    return result;
}

ManoTranslator::string ManoTranslator::Decode(const ManoTranslator::string& str) const
{
    ManoTranslator::string ret = L"";

    const ManoTranslator::string howa = L"‚Ù‚í‚Á";
    const ManoTranslator::string mun = L"‚Þ‚ñ‚Á";
   
    int seek = 0;

    ManoTranslator::string match = L"";

    while (seek < str.length())
    {
        auto c = str[seek];

        if (c != howa.front() && c != mun.front())
        {
            ret += match;
            ret += c;
            seek++;
            match = L"";
            continue;
        }

        //I—¹ˆ—
        if (str.length() - seek < 3)
        {
            ret += str.substr(seek);
            break;
        }

        auto s = str.substr(seek, 3);

        if (s != howa && s != mun)
        {
            ret += match;
            ret += c;
            seek++;
            match = L"";
            continue;
        }

        match += s;
        seek += 3;

        if (m_decoder.count(match) != 0)
        {
            ret += m_decoder.at(match);
            match.clear();
            continue;
        }
    }
    ret += match;

    return ret;
}

void ManoTranslator::DecoderMaker(Decoder& dictionary)
{
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12435;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12353;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 103;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 89;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 43;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12413;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12401;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 35;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12405;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 114;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12419;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12371;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12384;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12434;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12402;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12366;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12423;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12383;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12420;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 95;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 53;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 110;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12377;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 52;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 76;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12368;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12409;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 115;
    dictionary[L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12388;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12540;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12425;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 56;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 100;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12429;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 111;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12399;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12381;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 117;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 68;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 120;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 122;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12378;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 116;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12390;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12379;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 50;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12400;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12431;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12394;
    dictionary[L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12356;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12375;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12360;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 80;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12412;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 70;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 37;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 38;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12396;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 41;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 71;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 40;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12424;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12393;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12398;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 49;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 67;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 78;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12374;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 58;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12411;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12385;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12373;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12362;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12367;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 46;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 66;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 94;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 36;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 92;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12357;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 39;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 124;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12410;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 42;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 126;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 59;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12359;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12416;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12428;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12364;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 72;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 87;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 63;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 86;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 101;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12397;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 69;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 98;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 51;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12365;
    dictionary[L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12358;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12395;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12392;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 82;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 83;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 118;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 73;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 108;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12408;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 113;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12386;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 44;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12404;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 33;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 54;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 102;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 48;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 104;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 97;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12417;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 84;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 55;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 85;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12427;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12414;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 109;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 64;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12372;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 81;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 106;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 57;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12354;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12421;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 105;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12376;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 47;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12418;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12403;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 90;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 45;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 61;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 125;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12361;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12355;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 123;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12407;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 91;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 93;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12382;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 121;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12415;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12369;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12363;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 12426;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 119;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12389;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 74;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 79;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 77;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 112;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12391;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 65;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12422;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 12370;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 12406;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12380;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 99;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á"] = 34;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á"] = 88;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á"] = 75;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 107;
    dictionary[L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á"] = 12387;

}

void ManoTranslator::EncoderMaker(Encoder& dictionary)
{
    dictionary[12435] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12353] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[103] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[89] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[43] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12413] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12401] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[35] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12405] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[114] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12419] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12371] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12384] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12434] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12402] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12366] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12423] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12383] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12420] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[95] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[53] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[110] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12377] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[52] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[76] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12368] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12409] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[115] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12388] = L"‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12540] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12425] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[56] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[100] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12429] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[111] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12399] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12381] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[117] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[68] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[120] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[122] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12378] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[116] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12390] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12379] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[50] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12400] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12431] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12394] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12356] = L"‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12375] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12360] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[80] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12412] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[70] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[37] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[38] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12396] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[41] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[71] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[40] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12424] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12393] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12398] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[49] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[67] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[78] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12374] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[58] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12411] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12385] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12373] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12362] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12367] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[46] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[66] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[94] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[36] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[92] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12357] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[39] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[124] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12410] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[42] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[126] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[59] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12359] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12416] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12428] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12364] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[72] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[87] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[63] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[86] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[101] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12397] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[69] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[98] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[51] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12365] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12358] = L"‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12395] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12392] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[82] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[83] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[118] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[73] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[108] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12408] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[113] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12386] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[44] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12404] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[33] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[54] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[102] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[48] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[104] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[97] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12417] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[84] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[55] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[85] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12427] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12414] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[109] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[64] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12372] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[81] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[106] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[57] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12354] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12421] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[105] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12376] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[47] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12418] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12403] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[90] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[45] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[61] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[125] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12361] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12355] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[123] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12407] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[91] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[93] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12382] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[121] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12415] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12369] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12363] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12426] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[119] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12389] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[74] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[79] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[77] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[112] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12391] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[65] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[12422] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12370] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[12406] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[12380] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[99] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[34] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á";
    dictionary[88] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Ù‚í‚Á";
    dictionary[75] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á";
    dictionary[107] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Ù‚í‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
    dictionary[12387] = L"‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á‚Þ‚ñ‚Á";
}
