#include <iostream>
#include <string>
#include <unordered_map>
#include <locale>
#include <clocale>
#include <algorithm>
#include <climits>
#include <iomanip>

using std::cout;
using std::endl;

//https://gist.github.com/calbonaler/1231f78c63fb0b78d26d368a025b1cce
std::string toChars(int ch) {
    std::string chars;
    unsigned int chu = static_cast<unsigned int>(ch);
    for (size_t i = 0; i < sizeof(chu); ++i)
    {
        char ch = static_cast<char>((chu >> (i * CHAR_BIT)) & ((1u << CHAR_BIT) - 1u));
        if (!ch) break;
        chars.push_back(ch);
    }
    std::reverse(chars.begin(), chars.end());
    return chars;
}

class ManoTranslator
{
public: //alias
    
    using string = std::wstring;

    using Encoder = std::unordered_map<wchar_t, ManoTranslator::string>;
    using Decoder = std::unordered_map<ManoTranslator::string, wchar_t>;
    //私には時間がないんです。今はワイド文字でも許してください

private: //variables

    Encoder m_encoder;
    Decoder m_decoder;

public: //constructors

    ManoTranslator();

public: //funcs

    [[nodiscard]]
    Encoder GetEncoder() const
    {
        return m_encoder;
    }

    [[nodiscard]]
    Decoder GetDecoder() const
    {
        return m_decoder;
    }

    //[[nodiscard]]
    ManoTranslator::string Encode(const ManoTranslator::string& str) const;

    //[[nodiscard]]
    ManoTranslator::string Decode(const ManoTranslator::string& str) const;


public: //static funcs

//    [[nodiscard]]
//    static ManoTranslator::string to_string(ManoTranslator::string str);
    static void EncoderMaker(Encoder& dictionary);
    static void DecoderMaker(Decoder& dictionary);
};


int main()
{
    ManoTranslator mano;



    return 0;
}

ManoTranslator::ManoTranslator()
{
    EncoderMaker(m_encoder);
    DecoderMaker(m_decoder);
}

ManoTranslator::string ManoTranslator::Encode(const ManoTranslator::string& str) const
{
    ManoTranslator::string result;

    for (auto w : str)
    {
        if (m_encoder.count(w) == 0)
        {
            result += w;
            continue;
        }
        result += m_encoder.at(w);
    }

    return result;
}

ManoTranslator::string ManoTranslator::Decode(const ManoTranslator::string& str) const
{
    ManoTranslator::string ret = L"";

    const ManoTranslator::string howa = L"ほわっ";
    const ManoTranslator::string mun = L"むんっ";
   
    int seek = 0;

    ManoTranslator::string match = L"";

    while (seek < str.length())
    {
        auto c = str[seek];

        if (c != howa.front() && c != mun.front())
        {
            ret += match;
            ret += c;
            seek++;
            match = L"";
            continue;
        }

        //終了処理
        if (str.length() - seek < 3)
        {
            ret += str.substr(seek);
            break;
        }

        auto s = str.substr(seek, 3);

        if (s != howa && s != mun)
        {
            ret += match;
            ret += c;
            seek++;
            match = L"";
            continue;
        }

        match += s;
        seek += 3;

        if (m_decoder.count(match) != 0)
        {
            ret += m_decoder.at(match);
            match.clear();
            continue;
        }
    }
    ret += match;

    return ret;
}

void ManoTranslator::DecoderMaker(Decoder& dictionary)
{
    dictionary[L"ほわっほわっほわっほわっ"] = 12435;
    dictionary[L"ほわっほわっほわっむんっほわっほわっほわっほわっほわっ"] = 12353;
    dictionary[L"ほわっほわっほわっむんっほわっほわっほわっほわっむんっ"] = 103;
    dictionary[L"ほわっほわっほわっむんっほわっほわっほわっむんっほわっほわっ"] = 89;
    dictionary[L"ほわっほわっほわっむんっほわっほわっほわっむんっほわっむんっほわっ"] = 43;
    dictionary[L"ほわっほわっほわっむんっほわっほわっほわっむんっほわっむんっむんっ"] = 12413;
    dictionary[L"ほわっほわっほわっむんっほわっほわっほわっむんっむんっほわっ"] = 12401;
    dictionary[L"ほわっほわっほわっむんっほわっほわっほわっむんっむんっむんっ"] = 35;
    dictionary[L"ほわっほわっほわっむんっほわっほわっむんっほわっ"] = 12405;
    dictionary[L"ほわっほわっほわっむんっほわっほわっむんっむんっ"] = 114;
    dictionary[L"ほわっほわっほわっむんっほわっむんっ"] = 12419;
    dictionary[L"ほわっほわっほわっむんっむんっほわっ"] = 12371;
    dictionary[L"ほわっほわっほわっむんっむんっむんっ"] = 12384;
    dictionary[L"ほわっほわっむんっほわっほわっほわっほわっ"] = 12434;
    dictionary[L"ほわっほわっむんっほわっほわっほわっむんっほわっ"] = 12402;
    dictionary[L"ほわっほわっむんっほわっほわっほわっむんっむんっ"] = 12366;
    dictionary[L"ほわっほわっむんっほわっほわっむんっ"] = 12423;
    dictionary[L"ほわっほわっむんっほわっむんっ"] = 12383;
    dictionary[L"ほわっほわっむんっむんっほわっほわっほわっ"] = 12420;
    dictionary[L"ほわっほわっむんっむんっほわっほわっむんっほわっほわっ"] = 95;
    dictionary[L"ほわっほわっむんっむんっほわっほわっむんっほわっむんっ"] = 53;
    dictionary[L"ほわっほわっむんっむんっほわっほわっむんっむんっ"] = 110;
    dictionary[L"ほわっほわっむんっむんっほわっむんっ"] = 12377;
    dictionary[L"ほわっほわっむんっむんっむんっほわっほわっほわっほわっ"] = 52;
    dictionary[L"ほわっほわっむんっむんっむんっほわっほわっほわっむんっ"] = 76;
    dictionary[L"ほわっほわっむんっむんっむんっほわっほわっむんっほわっ"] = 12368;
    dictionary[L"ほわっほわっむんっむんっむんっほわっほわっむんっむんっ"] = 12409;
    dictionary[L"ほわっほわっむんっむんっむんっほわっむんっ"] = 115;
    dictionary[L"ほわっほわっむんっむんっむんっむんっ"] = 12388;
    dictionary[L"ほわっむんっほわっほわっほわっほわっ"] = 12540;
    dictionary[L"ほわっむんっほわっほわっほわっむんっ"] = 12425;
    dictionary[L"ほわっむんっほわっほわっむんっほわっほわっほわっほわっ"] = 56;
    dictionary[L"ほわっむんっほわっほわっむんっほわっほわっほわっむんっ"] = 100;
    dictionary[L"ほわっむんっほわっほわっむんっほわっほわっむんっ"] = 12429;
    dictionary[L"ほわっむんっほわっほわっむんっほわっむんっ"] = 111;
    dictionary[L"ほわっむんっほわっほわっむんっむんっ"] = 12399;
    dictionary[L"ほわっむんっほわっむんっほわっほわっほわっ"] = 12381;
    dictionary[L"ほわっむんっほわっむんっほわっほわっむんっほわっほわっ"] = 117;
    dictionary[L"ほわっむんっほわっむんっほわっほわっむんっほわっむんっ"] = 68;
    dictionary[L"ほわっむんっほわっむんっほわっほわっむんっむんっほわっほわっ"] = 120;
    dictionary[L"ほわっむんっほわっむんっほわっほわっむんっむんっほわっむんっ"] = 122;
    dictionary[L"ほわっむんっほわっむんっほわっほわっむんっむんっむんっ"] = 12378;
    dictionary[L"ほわっむんっほわっむんっほわっむんっ"] = 116;
    dictionary[L"ほわっむんっほわっむんっむんっ"] = 12390;
    dictionary[L"ほわっむんっむんっほわっほわっほわっほわっ"] = 12379;
    dictionary[L"ほわっむんっむんっほわっほわっほわっむんっほわっ"] = 50;
    dictionary[L"ほわっむんっむんっほわっほわっほわっむんっむんっ"] = 12400;
    dictionary[L"ほわっむんっむんっほわっほわっむんっ"] = 12431;
    dictionary[L"ほわっむんっむんっほわっむんっ"] = 12394;
    dictionary[L"ほわっむんっむんっむんっ"] = 12356;
    dictionary[L"むんっほわっほわっほわっほわっ"] = 12375;
    dictionary[L"むんっほわっほわっほわっむんっほわっほわっ"] = 12360;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっほわっほわっ"] = 80;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっほわっむんっほわっ"] = 12412;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっほわっむんっむんっ"] = 70;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっむんっほわっほわっほわっほわっ"] = 37;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっむんっほわっほわっほわっむんっ"] = 38;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっむんっほわっほわっむんっ"] = 12396;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっむんっほわっむんっ"] = 41;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっむんっむんっほわっ"] = 71;
    dictionary[L"むんっほわっほわっほわっむんっほわっむんっむんっむんっむんっ"] = 40;
    dictionary[L"むんっほわっほわっほわっむんっむんっほわっ"] = 12424;
    dictionary[L"むんっほわっほわっほわっむんっむんっむんっ"] = 12393;
    dictionary[L"むんっほわっほわっむんっほわっ"] = 12398;
    dictionary[L"むんっほわっほわっむんっむんっほわっほわっほわっ"] = 49;
    dictionary[L"むんっほわっほわっむんっむんっほわっほわっむんっほわっ"] = 67;
    dictionary[L"むんっほわっほわっむんっむんっほわっほわっむんっむんっほわっ"] = 78;
    dictionary[L"むんっほわっほわっむんっむんっほわっほわっむんっむんっむんっ"] = 12374;
    dictionary[L"むんっほわっほわっむんっむんっほわっむんっほわっ"] = 58;
    dictionary[L"むんっほわっほわっむんっむんっほわっむんっむんっ"] = 12411;
    dictionary[L"むんっほわっほわっむんっむんっむんっ"] = 12385;
    dictionary[L"むんっほわっむんっほわっほわっほわっほわっ"] = 12373;
    dictionary[L"むんっほわっむんっほわっほわっほわっむんっ"] = 12362;
    dictionary[L"むんっほわっむんっほわっほわっむんっ"] = 12367;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっほわっ"] = 46;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっほわっ"] = 66;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっほわっ"] = 94;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっほわっほわっほわっ"] = 36;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっほわっほわっむんっ"] = 92;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっほわっむんっ"] = 12357;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっむんっ"] = 39;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっむんっ"] = 124;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっむんっほわっ"] = 12410;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっ"] = 42;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっむんっ"] = 126;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっむんっ"] = 59;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっむんっ"] = 12359;
    dictionary[L"むんっほわっむんっほわっむんっほわっほわっむんっむんっ"] = 12416;
    dictionary[L"むんっほわっむんっほわっむんっほわっむんっ"] = 12428;
    dictionary[L"むんっほわっむんっほわっむんっむんっ"] = 12364;
    dictionary[L"むんっほわっむんっむんっほわっほわっほわっほわっほわっほわっ"] = 72;
    dictionary[L"むんっほわっむんっむんっほわっほわっほわっほわっほわっむんっ"] = 87;
    dictionary[L"むんっほわっむんっむんっほわっほわっほわっほわっむんっほわっ"] = 63;
    dictionary[L"むんっほわっむんっむんっほわっほわっほわっほわっむんっむんっ"] = 86;
    dictionary[L"むんっほわっむんっむんっほわっほわっほわっむんっ"] = 101;
    dictionary[L"むんっほわっむんっむんっほわっほわっむんっほわっ"] = 12397;
    dictionary[L"むんっほわっむんっむんっほわっほわっむんっむんっほわっほわっ"] = 69;
    dictionary[L"むんっほわっむんっむんっほわっほわっむんっむんっほわっむんっ"] = 98;
    dictionary[L"むんっほわっむんっむんっほわっほわっむんっむんっむんっ"] = 51;
    dictionary[L"むんっほわっむんっむんっほわっむんっ"] = 12365;
    dictionary[L"むんっほわっむんっむんっむんっ"] = 12358;
    dictionary[L"むんっむんっほわっほわっほわっほわっ"] = 12395;
    dictionary[L"むんっむんっほわっほわっほわっむんっ"] = 12392;
    dictionary[L"むんっむんっほわっほわっむんっほわっほわっほわっほわっ"] = 82;
    dictionary[L"むんっむんっほわっほわっむんっほわっほわっほわっむんっ"] = 83;
    dictionary[L"むんっむんっほわっほわっむんっほわっほわっむんっほわっほわっ"] = 118;
    dictionary[L"むんっむんっほわっほわっむんっほわっほわっむんっほわっむんっ"] = 73;
    dictionary[L"むんっむんっほわっほわっむんっほわっほわっむんっむんっ"] = 108;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっほわっほわっ"] = 12408;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっほわっ"] = 113;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっほわっほわっ"] = 12386;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっほわっむんっ"] = 44;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっむんっ"] = 12404;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっむんっ"] = 33;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっむんっほわっ"] = 54;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっほわっむんっむんっ"] = 102;
    dictionary[L"むんっむんっほわっほわっむんっほわっむんっむんっ"] = 48;
    dictionary[L"むんっむんっほわっほわっむんっむんっほわっほわっ"] = 104;
    dictionary[L"むんっむんっほわっほわっむんっむんっほわっむんっ"] = 97;
    dictionary[L"むんっむんっほわっほわっむんっむんっむんっほわっ"] = 12417;
    dictionary[L"むんっむんっほわっほわっむんっむんっむんっむんっほわっ"] = 84;
    dictionary[L"むんっむんっほわっほわっむんっむんっむんっむんっむんっほわっ"] = 55;
    dictionary[L"むんっむんっほわっほわっむんっむんっむんっむんっむんっむんっ"] = 85;
    dictionary[L"むんっむんっほわっむんっほわっほわっ"] = 12427;
    dictionary[L"むんっむんっほわっむんっほわっむんっ"] = 12414;
    dictionary[L"むんっむんっほわっむんっむんっほわっほわっほわっほわっ"] = 109;
    dictionary[L"むんっむんっほわっむんっむんっほわっほわっほわっむんっ"] = 64;
    dictionary[L"むんっむんっほわっむんっむんっほわっほわっむんっほわっ"] = 12372;
    dictionary[L"むんっむんっほわっむんっむんっほわっほわっむんっむんっほわっほわっ"] = 81;
    dictionary[L"むんっむんっほわっむんっむんっほわっほわっむんっむんっほわっむんっ"] = 106;
    dictionary[L"むんっむんっほわっむんっむんっほわっほわっむんっむんっむんっ"] = 57;
    dictionary[L"むんっむんっほわっむんっむんっほわっむんっ"] = 12354;
    dictionary[L"むんっむんっほわっむんっむんっむんっほわっほわっ"] = 12421;
    dictionary[L"むんっむんっほわっむんっむんっむんっほわっむんっ"] = 105;
    dictionary[L"むんっむんっほわっむんっむんっむんっむんっ"] = 12376;
    dictionary[L"むんっむんっむんっほわっほわっほわっほわっ"] = 47;
    dictionary[L"むんっむんっむんっほわっほわっほわっむんっ"] = 12418;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっほわっ"] = 12403;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっほわっ"] = 90;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっほわっ"] = 45;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっほわっ"] = 61;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっほわっほわっ"] = 125;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっほわっむんっ"] = 12361;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっむんっほわっ"] = 12355;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっむんっむんっ"] = 123;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっむんっほわっ"] = 12407;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっむんっむんっほわっ"] = 91;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっむんっむんっむんっ"] = 93;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっむんっほわっ"] = 12382;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっほわっむんっむんっ"] = 121;
    dictionary[L"むんっむんっむんっほわっほわっむんっほわっむんっ"] = 12415;
    dictionary[L"むんっむんっむんっほわっほわっむんっむんっ"] = 12369;
    dictionary[L"むんっむんっむんっほわっむんっ"] = 12363;
    dictionary[L"むんっむんっむんっむんっほわっほわっほわっ"] = 12426;
    dictionary[L"むんっむんっむんっむんっほわっほわっむんっほわっほわっほわっ"] = 119;
    dictionary[L"むんっむんっむんっむんっほわっほわっむんっほわっほわっむんっほわっ"] = 12389;
    dictionary[L"むんっむんっむんっむんっほわっほわっむんっほわっほわっむんっむんっ"] = 74;
    dictionary[L"むんっむんっむんっむんっほわっほわっむんっほわっむんっほわっ"] = 79;
    dictionary[L"むんっむんっむんっむんっほわっほわっむんっほわっむんっむんっ"] = 77;
    dictionary[L"むんっむんっむんっむんっほわっほわっむんっむんっ"] = 112;
    dictionary[L"むんっむんっむんっむんっほわっむんっ"] = 12391;
    dictionary[L"むんっむんっむんっむんっむんっほわっほわっほわっほわっほわっ"] = 65;
    dictionary[L"むんっむんっむんっむんっむんっほわっほわっほわっほわっむんっ"] = 12422;
    dictionary[L"むんっむんっむんっむんっむんっほわっほわっほわっむんっ"] = 12370;
    dictionary[L"むんっむんっむんっむんっむんっほわっほわっむんっほわっ"] = 12406;
    dictionary[L"むんっむんっむんっむんっむんっほわっほわっむんっむんっ"] = 12380;
    dictionary[L"むんっむんっむんっむんっむんっほわっむんっほわっ"] = 99;
    dictionary[L"むんっむんっむんっむんっむんっほわっむんっむんっほわっ"] = 34;
    dictionary[L"むんっむんっむんっむんっむんっほわっむんっむんっむんっほわっほわっ"] = 88;
    dictionary[L"むんっむんっむんっむんっむんっほわっむんっむんっむんっほわっむんっ"] = 75;
    dictionary[L"むんっむんっむんっむんっむんっほわっむんっむんっむんっむんっ"] = 107;
    dictionary[L"むんっむんっむんっむんっむんっむんっ"] = 12387;

}

void ManoTranslator::EncoderMaker(Encoder& dictionary)
{
    dictionary[12435] = L"ほわっほわっほわっほわっ";
    dictionary[12353] = L"ほわっほわっほわっむんっほわっほわっほわっほわっほわっ";
    dictionary[103] = L"ほわっほわっほわっむんっほわっほわっほわっほわっむんっ";
    dictionary[89] = L"ほわっほわっほわっむんっほわっほわっほわっむんっほわっほわっ";
    dictionary[43] = L"ほわっほわっほわっむんっほわっほわっほわっむんっほわっむんっほわっ";
    dictionary[12413] = L"ほわっほわっほわっむんっほわっほわっほわっむんっほわっむんっむんっ";
    dictionary[12401] = L"ほわっほわっほわっむんっほわっほわっほわっむんっむんっほわっ";
    dictionary[35] = L"ほわっほわっほわっむんっほわっほわっほわっむんっむんっむんっ";
    dictionary[12405] = L"ほわっほわっほわっむんっほわっほわっむんっほわっ";
    dictionary[114] = L"ほわっほわっほわっむんっほわっほわっむんっむんっ";
    dictionary[12419] = L"ほわっほわっほわっむんっほわっむんっ";
    dictionary[12371] = L"ほわっほわっほわっむんっむんっほわっ";
    dictionary[12384] = L"ほわっほわっほわっむんっむんっむんっ";
    dictionary[12434] = L"ほわっほわっむんっほわっほわっほわっほわっ";
    dictionary[12402] = L"ほわっほわっむんっほわっほわっほわっむんっほわっ";
    dictionary[12366] = L"ほわっほわっむんっほわっほわっほわっむんっむんっ";
    dictionary[12423] = L"ほわっほわっむんっほわっほわっむんっ";
    dictionary[12383] = L"ほわっほわっむんっほわっむんっ";
    dictionary[12420] = L"ほわっほわっむんっむんっほわっほわっほわっ";
    dictionary[95] = L"ほわっほわっむんっむんっほわっほわっむんっほわっほわっ";
    dictionary[53] = L"ほわっほわっむんっむんっほわっほわっむんっほわっむんっ";
    dictionary[110] = L"ほわっほわっむんっむんっほわっほわっむんっむんっ";
    dictionary[12377] = L"ほわっほわっむんっむんっほわっむんっ";
    dictionary[52] = L"ほわっほわっむんっむんっむんっほわっほわっほわっほわっ";
    dictionary[76] = L"ほわっほわっむんっむんっむんっほわっほわっほわっむんっ";
    dictionary[12368] = L"ほわっほわっむんっむんっむんっほわっほわっむんっほわっ";
    dictionary[12409] = L"ほわっほわっむんっむんっむんっほわっほわっむんっむんっ";
    dictionary[115] = L"ほわっほわっむんっむんっむんっほわっむんっ";
    dictionary[12388] = L"ほわっほわっむんっむんっむんっむんっ";
    dictionary[12540] = L"ほわっむんっほわっほわっほわっほわっ";
    dictionary[12425] = L"ほわっむんっほわっほわっほわっむんっ";
    dictionary[56] = L"ほわっむんっほわっほわっむんっほわっほわっほわっほわっ";
    dictionary[100] = L"ほわっむんっほわっほわっむんっほわっほわっほわっむんっ";
    dictionary[12429] = L"ほわっむんっほわっほわっむんっほわっほわっむんっ";
    dictionary[111] = L"ほわっむんっほわっほわっむんっほわっむんっ";
    dictionary[12399] = L"ほわっむんっほわっほわっむんっむんっ";
    dictionary[12381] = L"ほわっむんっほわっむんっほわっほわっほわっ";
    dictionary[117] = L"ほわっむんっほわっむんっほわっほわっむんっほわっほわっ";
    dictionary[68] = L"ほわっむんっほわっむんっほわっほわっむんっほわっむんっ";
    dictionary[120] = L"ほわっむんっほわっむんっほわっほわっむんっむんっほわっほわっ";
    dictionary[122] = L"ほわっむんっほわっむんっほわっほわっむんっむんっほわっむんっ";
    dictionary[12378] = L"ほわっむんっほわっむんっほわっほわっむんっむんっむんっ";
    dictionary[116] = L"ほわっむんっほわっむんっほわっむんっ";
    dictionary[12390] = L"ほわっむんっほわっむんっむんっ";
    dictionary[12379] = L"ほわっむんっむんっほわっほわっほわっほわっ";
    dictionary[50] = L"ほわっむんっむんっほわっほわっほわっむんっほわっ";
    dictionary[12400] = L"ほわっむんっむんっほわっほわっほわっむんっむんっ";
    dictionary[12431] = L"ほわっむんっむんっほわっほわっむんっ";
    dictionary[12394] = L"ほわっむんっむんっほわっむんっ";
    dictionary[12356] = L"ほわっむんっむんっむんっ";
    dictionary[12375] = L"むんっほわっほわっほわっほわっ";
    dictionary[12360] = L"むんっほわっほわっほわっむんっほわっほわっ";
    dictionary[80] = L"むんっほわっほわっほわっむんっほわっむんっほわっほわっ";
    dictionary[12412] = L"むんっほわっほわっほわっむんっほわっむんっほわっむんっほわっ";
    dictionary[70] = L"むんっほわっほわっほわっむんっほわっむんっほわっむんっむんっ";
    dictionary[37] = L"むんっほわっほわっほわっむんっほわっむんっむんっほわっほわっほわっほわっ";
    dictionary[38] = L"むんっほわっほわっほわっむんっほわっむんっむんっほわっほわっほわっむんっ";
    dictionary[12396] = L"むんっほわっほわっほわっむんっほわっむんっむんっほわっほわっむんっ";
    dictionary[41] = L"むんっほわっほわっほわっむんっほわっむんっむんっほわっむんっ";
    dictionary[71] = L"むんっほわっほわっほわっむんっほわっむんっむんっむんっほわっ";
    dictionary[40] = L"むんっほわっほわっほわっむんっほわっむんっむんっむんっむんっ";
    dictionary[12424] = L"むんっほわっほわっほわっむんっむんっほわっ";
    dictionary[12393] = L"むんっほわっほわっほわっむんっむんっむんっ";
    dictionary[12398] = L"むんっほわっほわっむんっほわっ";
    dictionary[49] = L"むんっほわっほわっむんっむんっほわっほわっほわっ";
    dictionary[67] = L"むんっほわっほわっむんっむんっほわっほわっむんっほわっ";
    dictionary[78] = L"むんっほわっほわっむんっむんっほわっほわっむんっむんっほわっ";
    dictionary[12374] = L"むんっほわっほわっむんっむんっほわっほわっむんっむんっむんっ";
    dictionary[58] = L"むんっほわっほわっむんっむんっほわっむんっほわっ";
    dictionary[12411] = L"むんっほわっほわっむんっむんっほわっむんっむんっ";
    dictionary[12385] = L"むんっほわっほわっむんっむんっむんっ";
    dictionary[12373] = L"むんっほわっむんっほわっほわっほわっほわっ";
    dictionary[12362] = L"むんっほわっむんっほわっほわっほわっむんっ";
    dictionary[12367] = L"むんっほわっむんっほわっほわっむんっ";
    dictionary[46] = L"むんっほわっむんっほわっむんっほわっほわっほわっ";
    dictionary[66] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっほわっ";
    dictionary[94] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっほわっ";
    dictionary[36] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっほわっほわっほわっ";
    dictionary[92] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっほわっほわっむんっ";
    dictionary[12357] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっほわっむんっ";
    dictionary[39] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっほわっむんっむんっ";
    dictionary[124] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっほわっむんっ";
    dictionary[12410] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっむんっほわっ";
    dictionary[42] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっ";
    dictionary[126] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっむんっ";
    dictionary[59] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっほわっむんっ";
    dictionary[12359] = L"むんっほわっむんっほわっむんっほわっほわっむんっほわっむんっむんっ";
    dictionary[12416] = L"むんっほわっむんっほわっむんっほわっほわっむんっむんっ";
    dictionary[12428] = L"むんっほわっむんっほわっむんっほわっむんっ";
    dictionary[12364] = L"むんっほわっむんっほわっむんっむんっ";
    dictionary[72] = L"むんっほわっむんっむんっほわっほわっほわっほわっほわっほわっ";
    dictionary[87] = L"むんっほわっむんっむんっほわっほわっほわっほわっほわっむんっ";
    dictionary[63] = L"むんっほわっむんっむんっほわっほわっほわっほわっむんっほわっ";
    dictionary[86] = L"むんっほわっむんっむんっほわっほわっほわっほわっむんっむんっ";
    dictionary[101] = L"むんっほわっむんっむんっほわっほわっほわっむんっ";
    dictionary[12397] = L"むんっほわっむんっむんっほわっほわっむんっほわっ";
    dictionary[69] = L"むんっほわっむんっむんっほわっほわっむんっむんっほわっほわっ";
    dictionary[98] = L"むんっほわっむんっむんっほわっほわっむんっむんっほわっむんっ";
    dictionary[51] = L"むんっほわっむんっむんっほわっほわっむんっむんっむんっ";
    dictionary[12365] = L"むんっほわっむんっむんっほわっむんっ";
    dictionary[12358] = L"むんっほわっむんっむんっむんっ";
    dictionary[12395] = L"むんっむんっほわっほわっほわっほわっ";
    dictionary[12392] = L"むんっむんっほわっほわっほわっむんっ";
    dictionary[82] = L"むんっむんっほわっほわっむんっほわっほわっほわっほわっ";
    dictionary[83] = L"むんっむんっほわっほわっむんっほわっほわっほわっむんっ";
    dictionary[118] = L"むんっむんっほわっほわっむんっほわっほわっむんっほわっほわっ";
    dictionary[73] = L"むんっむんっほわっほわっむんっほわっほわっむんっほわっむんっ";
    dictionary[108] = L"むんっむんっほわっほわっむんっほわっほわっむんっむんっ";
    dictionary[12408] = L"むんっむんっほわっほわっむんっほわっむんっほわっほわっほわっ";
    dictionary[113] = L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっほわっ";
    dictionary[12386] = L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっほわっほわっ";
    dictionary[44] = L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっほわっむんっ";
    dictionary[12404] = L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっほわっむんっ";
    dictionary[33] = L"むんっむんっほわっほわっむんっほわっむんっほわっほわっむんっむんっむんっ";
    dictionary[54] = L"むんっむんっほわっほわっむんっほわっむんっほわっむんっほわっ";
    dictionary[102] = L"むんっむんっほわっほわっむんっほわっむんっほわっむんっむんっ";
    dictionary[48] = L"むんっむんっほわっほわっむんっほわっむんっむんっ";
    dictionary[104] = L"むんっむんっほわっほわっむんっむんっほわっほわっ";
    dictionary[97] = L"むんっむんっほわっほわっむんっむんっほわっむんっ";
    dictionary[12417] = L"むんっむんっほわっほわっむんっむんっむんっほわっ";
    dictionary[84] = L"むんっむんっほわっほわっむんっむんっむんっむんっほわっ";
    dictionary[55] = L"むんっむんっほわっほわっむんっむんっむんっむんっむんっほわっ";
    dictionary[85] = L"むんっむんっほわっほわっむんっむんっむんっむんっむんっむんっ";
    dictionary[12427] = L"むんっむんっほわっむんっほわっほわっ";
    dictionary[12414] = L"むんっむんっほわっむんっほわっむんっ";
    dictionary[109] = L"むんっむんっほわっむんっむんっほわっほわっほわっほわっ";
    dictionary[64] = L"むんっむんっほわっむんっむんっほわっほわっほわっむんっ";
    dictionary[12372] = L"むんっむんっほわっむんっむんっほわっほわっむんっほわっ";
    dictionary[81] = L"むんっむんっほわっむんっむんっほわっほわっむんっむんっほわっほわっ";
    dictionary[106] = L"むんっむんっほわっむんっむんっほわっほわっむんっむんっほわっむんっ";
    dictionary[57] = L"むんっむんっほわっむんっむんっほわっほわっむんっむんっむんっ";
    dictionary[12354] = L"むんっむんっほわっむんっむんっほわっむんっ";
    dictionary[12421] = L"むんっむんっほわっむんっむんっむんっほわっほわっ";
    dictionary[105] = L"むんっむんっほわっむんっむんっむんっほわっむんっ";
    dictionary[12376] = L"むんっむんっほわっむんっむんっむんっむんっ";
    dictionary[47] = L"むんっむんっむんっほわっほわっほわっほわっ";
    dictionary[12418] = L"むんっむんっむんっほわっほわっほわっむんっ";
    dictionary[12403] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっほわっ";
    dictionary[90] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっほわっ";
    dictionary[45] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっほわっ";
    dictionary[61] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっほわっ";
    dictionary[125] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっほわっほわっ";
    dictionary[12361] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっほわっむんっ";
    dictionary[12355] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっむんっほわっ";
    dictionary[123] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっほわっむんっむんっむんっ";
    dictionary[12407] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっむんっほわっ";
    dictionary[91] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっむんっむんっほわっ";
    dictionary[93] = L"むんっむんっむんっほわっほわっむんっほわっほわっほわっむんっむんっむんっむんっむんっむんっ";
    dictionary[12382] = L"むんっむんっむんっほわっほわっむんっほわっほわっむんっほわっ";
    dictionary[121] = L"むんっむんっむんっほわっほわっむんっほわっほわっむんっむんっ";
    dictionary[12415] = L"むんっむんっむんっほわっほわっむんっほわっむんっ";
    dictionary[12369] = L"むんっむんっむんっほわっほわっむんっむんっ";
    dictionary[12363] = L"むんっむんっむんっほわっむんっ";
    dictionary[12426] = L"むんっむんっむんっむんっほわっほわっほわっ";
    dictionary[119] = L"むんっむんっむんっむんっほわっほわっむんっほわっほわっほわっ";
    dictionary[12389] = L"むんっむんっむんっむんっほわっほわっむんっほわっほわっむんっほわっ";
    dictionary[74] = L"むんっむんっむんっむんっほわっほわっむんっほわっほわっむんっむんっ";
    dictionary[79] = L"むんっむんっむんっむんっほわっほわっむんっほわっむんっほわっ";
    dictionary[77] = L"むんっむんっむんっむんっほわっほわっむんっほわっむんっむんっ";
    dictionary[112] = L"むんっむんっむんっむんっほわっほわっむんっむんっ";
    dictionary[12391] = L"むんっむんっむんっむんっほわっむんっ";
    dictionary[65] = L"むんっむんっむんっむんっむんっほわっほわっほわっほわっほわっ";
    dictionary[12422] = L"むんっむんっむんっむんっむんっほわっほわっほわっほわっむんっ";
    dictionary[12370] = L"むんっむんっむんっむんっむんっほわっほわっほわっむんっ";
    dictionary[12406] = L"むんっむんっむんっむんっむんっほわっほわっむんっほわっ";
    dictionary[12380] = L"むんっむんっむんっむんっむんっほわっほわっむんっむんっ";
    dictionary[99] = L"むんっむんっむんっむんっむんっほわっむんっほわっ";
    dictionary[34] = L"むんっむんっむんっむんっむんっほわっむんっむんっほわっ";
    dictionary[88] = L"むんっむんっむんっむんっむんっほわっむんっむんっむんっほわっほわっ";
    dictionary[75] = L"むんっむんっむんっむんっむんっほわっむんっむんっむんっほわっむんっ";
    dictionary[107] = L"むんっむんっむんっむんっむんっほわっむんっむんっむんっむんっ";
    dictionary[12387] = L"むんっむんっむんっむんっむんっむんっ";
}
