#pragma once

#include <unordered_map>

class ManoTranslator
{
public: //alias

    using string = std::wstring;

    using Encoder = std::unordered_map<wchar_t, ManoTranslator::string>;
    using Decoder = std::unordered_map<ManoTranslator::string, wchar_t>;
    //éÑÇ…ÇÕéûä‘Ç™Ç»Ç¢ÇÒÇ≈Ç∑ÅBç°ÇÕÉèÉCÉhï∂éöÇ≈Ç‡ãñÇµÇƒÇ≠ÇæÇ≥Ç¢

private: //variables

    Encoder m_encoder;
    Decoder m_decoder;

public: //constructors

    ManoTranslator();

public: //funcs

    [[nodiscard]]
    Encoder GetEncoder() const
    {
        return m_encoder;
    }

    [[nodiscard]]
    Decoder GetDecoder() const
    {
        return m_decoder;
    }

    //[[nodiscard]]
    ManoTranslator::string Encode(const ManoTranslator::string& str) const;

    //[[nodiscard]]
    ManoTranslator::string Decode(const ManoTranslator::string& str) const;


public: //static funcs

//    [[nodiscard]]
//    static ManoTranslator::string to_string(ManoTranslator::string str);
    static void EncoderMaker(Encoder& dictionary);
    static void DecoderMaker(Decoder& dictionary);
};


void ManoTranslator::DecoderMaker(Decoder& dictionary)
{
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12435;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12353;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 103;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 89;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 43;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12413;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12401;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 35;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12405;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 114;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12419;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12371;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12384;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12434;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12402;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12366;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12423;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12383;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12420;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 95;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 53;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 110;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12377;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 52;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 76;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12368;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12409;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 115;
    dictionary[L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12388;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12540;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12425;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 56;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 100;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12429;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 111;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12399;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12381;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 117;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 68;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 120;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 122;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12378;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 116;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12390;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12379;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 50;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12400;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12431;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12394;
    dictionary[L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12356;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12375;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12360;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 80;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12412;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 70;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 37;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 38;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12396;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 41;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 71;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 40;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12424;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12393;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12398;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 49;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 67;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 78;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12374;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 58;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12411;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12385;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12373;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12362;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12367;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 46;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 66;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 94;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 36;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 92;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12357;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 39;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 124;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12410;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 42;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 126;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 59;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12359;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12416;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12428;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12364;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 72;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 87;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 63;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 86;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 101;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12397;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 69;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 98;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 51;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12365;
    dictionary[L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12358;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12395;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12392;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 82;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 83;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 118;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 73;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 108;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12408;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 113;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12386;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 44;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12404;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 33;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 54;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 102;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 48;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 104;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 97;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12417;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 84;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 55;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 85;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12427;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12414;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 109;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 64;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12372;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 81;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 106;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 57;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12354;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12421;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 105;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12376;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 47;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12418;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12403;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 90;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 45;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 61;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 125;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12361;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12355;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 123;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12407;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 91;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 93;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12382;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 121;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12415;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12369;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12363;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 12426;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 119;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12389;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 74;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 79;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 77;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 112;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12391;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 65;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12422;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 12370;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 12406;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12380;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 99;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡"] = 34;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡"] = 88;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡"] = 75;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 107;
    dictionary[L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡"] = 12387;

}

void ManoTranslator::EncoderMaker(Encoder& dictionary)
{
    dictionary[12435] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12353] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[103] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[89] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[43] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12413] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12401] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[35] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12405] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[114] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12419] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12371] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12384] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12434] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12402] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12366] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12423] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12383] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12420] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[95] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[53] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[110] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12377] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[52] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[76] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12368] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12409] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[115] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12388] = L"ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12540] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12425] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[56] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[100] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12429] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[111] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12399] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12381] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[117] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[68] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[120] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[122] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12378] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[116] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12390] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12379] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[50] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12400] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12431] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12394] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12356] = L"ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12375] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12360] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[80] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12412] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[70] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[37] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[38] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12396] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[41] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[71] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[40] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12424] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12393] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12398] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[49] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[67] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[78] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12374] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[58] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12411] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12385] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12373] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12362] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12367] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[46] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[66] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[94] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[36] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[92] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12357] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[39] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[124] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12410] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[42] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[126] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[59] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12359] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12416] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12428] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12364] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[72] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[87] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[63] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[86] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[101] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12397] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[69] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[98] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[51] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12365] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12358] = L"ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12395] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12392] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[82] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[83] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[118] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[73] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[108] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12408] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[113] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12386] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[44] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12404] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[33] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[54] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[102] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[48] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[104] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[97] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12417] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[84] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[55] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[85] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12427] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12414] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[109] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[64] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12372] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[81] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[106] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[57] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12354] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12421] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[105] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12376] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[47] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12418] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12403] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[90] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[45] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[61] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[125] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12361] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12355] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[123] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12407] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[91] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[93] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12382] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[121] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12415] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12369] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12363] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12426] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[119] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12389] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[74] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[79] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[77] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[112] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12391] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[65] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[12422] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12370] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[12406] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[12380] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[99] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[34] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡";
    dictionary[88] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇŸÇÌÇ¡";
    dictionary[75] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡";
    dictionary[107] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇŸÇÌÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
    dictionary[12387] = L"ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡ÇﬁÇÒÇ¡";
}
